cases/05_navier_stokes_equation/18_lid_driven_cavity_piso_Re3200_hybrid40/N40/Allrun.pre
#!/bin/sh

set -eu

caseDir=$(CDPATH= cd -- "$(dirname -- "$0")" && pwd)
projectRoot=$(CDPATH= cd -- "$caseDir/../../../.." && pwd)
cd "$caseDir"

: "${WM_PROJECT_DIR:?Please source /opt/openfoam14/etc/bashrc first}"
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

# 混合网格方腔流：
# 外圈为结构化四边形边界层，中心区域为三角形非结构网格。
# 该预处理与第一题混合网格一致，只是求解器换成了第五题的
# pisoFoamStudent。
gmshPython="${VIBEFLOW_PYTHON:-/home/a776/vibeflow/python-env/bin/python}"
if [ ! -x "$gmshPython" ]; then
    echo "Missing Gmsh Python interpreter: $gmshPython" >&2
    echo "Set VIBEFLOW_PYTHON to a Python environment containing gmsh." >&2
    exit 1
fi

sh "$caseDir/Allclean"
runApplication "$gmshPython" "$projectRoot/scripts/common/gmsh_hybrid_cavity_mesh.py"     --case "$caseDir"     --resolution 40     --boundary-layer-thickness 0.12     --boundary-layer-count 5     --thickness 0.1
runApplication -overwrite gmshToFoam "$caseDir/mesh/mesh.msh"
runApplication -overwrite createPatch
runApplication -overwrite checkMesh
runApplication -suffix centres foamPostProcess -constant -func writeCellCentres
runApplication -suffix volumes foamPostProcess -constant -func writeCellVolumes
python3 "$projectRoot/scripts/prepare_case.py"     --config "$projectRoot/scripts/configs/05_navier_stokes_equation/18_lid_driven_cavity_piso_Re3200_hybrid40.json"     --N 40     --refresh-initial-only
rm -rf "$caseDir/0"
cp -R "$caseDir/0.orig" "$caseDir/0"
