cases/05_navier_stokes_equation/18_lid_driven_cavity_piso_Re3200_hybrid40/N40/constant/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "constant";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2646
(
(0.0415106762428 0.019410578895 0.05)
(0.0736589819912 0.0742251165195 0.05)
(0.0190539000271 0.0415897801916 0.05)
(0.0968337791182 0.0428001190194 0.05)
(0.042562003425 0.0970262805309 0.05)
(0.685242393543 0.0245690603399 0.05)
(0.301258369796 0.0221878566863 0.05)
(0.446318315043 0.0227923900147 0.05)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 10((0.0299999999999 0 0.05) (0.0899999999999 0 0.05) (0.689999999999 0 0.05) (0.31 0 0.05) (0.436666666666 0 0.05) (0.183333333333 0 0.05) (0.563333333333 0 0.05) (0.816666666666 0 0.05) (0.97 0 0.05) (0.91 0 0.05));
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<vector> 10((0 0.0299999999999 0.05) (0 0.0899999999999 0.05) (0 0.689999999999 0.05) (0 0.31 0.05) (0 0.436666666666 0.05) (0 0.183333333333 0.05) (0 0.816666666666 0.05) (0 0.563333333333 0.05) (0 0.97 0.05) (0 0.91 0.05));
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<vector> 10((1 0.0299999999999 0.05) (1 0.0899999999999 0.05) (1 0.689999999999 0.05) (1 0.31 0.05) (1 0.436666666666 0.05) (1 0.183333333333 0.05) (1 0.563333333333 0.05) (1 0.816666666666 0.05) (1 0.97 0.05) (1 0.91 0.05));
    }
    movingTop
    {
        type            calculated;
        value           nonuniform List<vector> 10((0.0299999999999 1 0.05) (0.0899999999999 1 0.05) (0.689999999999 1 0.05) (0.31 1 0.05) (0.436666666666 1 0.05) (0.183333333333 1 0.05) (0.816666666666 1 0.05) (0.563333333333 1 0.05) (0.97 1 0.05) (0.91 1 0.05));
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
